In [1]:
import pandas as pd
import numpy as np

**Removing Duplicated**

In [3]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
....: 'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [4]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [5]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [7]:
data['v1']=range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [8]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [9]:
data.drop_duplicates(['k1','k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

**Transforming Data Using a Function or Mapping**

In [10]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
....: 'Pastrami', 'corned beef', 'Bacon',
....: 'pastrami', 'honey ham', 'nova lox'],
....: 'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [11]:
meat_to_animal = {
'bacon': 'pig',
'pulled pork': 'pig',
'pastrami': 'cow',
'corned beef': 'cow',
'honey ham': 'pig',
'nova lox': 'salmon'
}

In [12]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [14]:
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [16]:
data["food"].map(lambda x: meat_to_animal[x.lower()])#Using function

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

**Replacing Values**

In [17]:
data = pd.Series([1.,-999, 2., -999, -1000, 3])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [18]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [19]:
data.replace([-999,-1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [20]:
data.replace([-999,-1000], [np.nan,0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [21]:
data.replace({-999:np.nan, -1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

**Renaming Axis Indexes**

In [22]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
....: index=['Ohio', 'Colorado', 'New York'],
....: columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [23]:
transform = lambda x: x[:4].upper()

In [24]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [25]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [26]:
data.rename(index = str.title, columns = str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [27]:
data.rename(index={'OHIO': 'INDIANA'}, columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [28]:
data.rename(index = {'OHIO':'INDIANA'}, inplace=True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

**Discretization and Binning**

In [29]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [31]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [33]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [34]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [36]:
pd.cut(ages, [18, 26, 36, 61, 100], right = False)# (,] turn into [,) like in math

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [37]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins, labels = group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [38]:
data = np.random.rand(20)
pd.cut(data,4, precision = 2)#Cut to 4 intervals

[(0.77, 1.0], (0.078, 0.31], (0.77, 1.0], (0.54, 0.77], (0.078, 0.31], ..., (0.54, 0.77], (0.31, 0.54], (0.078, 0.31], (0.77, 1.0], (0.31, 0.54]]
Length: 20
Categories (4, interval[float64]): [(0.078, 0.31] < (0.31, 0.54] < (0.54, 0.77] < (0.77, 1.0]]

In [39]:
data = np.random.randn(1000)#Normal Distribution
cats = pd.qcut(data,4) #Cut to quartiles
cats

[(-0.593, 0.0223], (0.654, 3.044], (-0.593, 0.0223], (-3.33, -0.593], (-3.33, -0.593], ..., (0.654, 3.044], (-0.593, 0.0223], (0.654, 3.044], (0.654, 3.044], (0.654, 3.044]]
Length: 1000
Categories (4, interval[float64]): [(-3.33, -0.593] < (-0.593, 0.0223] < (0.0223, 0.654] < (0.654, 3.044]]

**Detecting and Filtering Outliers**

In [40]:
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.013152     0.020788     0.007399     0.027516
std       0.996200     0.978986     1.019550     1.033434
min      -3.282807    -3.618510    -3.711517    -3.880315
25%      -0.623954    -0.607175    -0.665319    -0.646345
50%       0.000610     0.011200     0.020183     0.036228
75%       0.681980     0.682103     0.660912     0.735966
max       3.211038     3.969355     3.459128     2.906542

In [41]:
col = data[2]
col[np.abs(col)>3]

243   -3.711517
320    3.459128
378   -3.079770
Name: 2, dtype: float64

In [42]:
data[(np.abs(data)>3).any(1)]

            0         1         2         3
126  1.037923 -1.254000 -1.257994 -3.880315
150  3.211038  0.381035  1.795524 -0.867113
243  0.646842  0.284732 -3.711517 -0.456698
320  1.283727  0.407873  3.459128 -0.992049
378  1.540066  1.722769 -3.079770  1.076447
478 -0.572206  3.969355 -0.551007 -0.602527
578  1.098264 -0.234222  0.661406 -3.286024
585 -0.064635 -3.618510  1.962263 -1.053246
877 -0.706377  0.528315 -0.307968 -3.405586
971 -3.282807  0.802152 -0.225722 -1.754666

In [46]:
data[np.abs(data)>3] = np.sign(data)*3#Sign produces 1 and -1 based on whether the data are positive or negative
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.013224     0.020437     0.007731     0.029088
std       0.994646     0.973431     1.015501     1.028316
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.623954    -0.607175    -0.665319    -0.646345
50%       0.000610     0.011200     0.020183     0.036228
75%       0.681980     0.682103     0.660912     0.735966
max       3.000000     3.000000     3.000000     2.906542

In [45]:
np.sign(data).head()

     0    1    2    3
0  1.0 -1.0  1.0  1.0
1 -1.0  1.0  1.0 -1.0
2 -1.0 -1.0 -1.0 -1.0
3  1.0 -1.0  1.0 -1.0
4 -1.0  1.0 -1.0 -1.0

**Permutation and Random Sampling**

In [48]:
df = pd.DataFrame(np.arange(5*4).reshape((5,4)))
sampler = np.random.permutation(5)
sampler

array([2, 0, 4, 1, 3])

In [49]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [50]:
df.take(sampler)

    0   1   2   3
2   8   9  10  11
0   0   1   2   3
4  16  17  18  19
1   4   5   6   7
3  12  13  14  15

In [54]:
df.sample(n=3) #sample without replacement

    0   1   2   3
3  12  13  14  15
0   0   1   2   3
4  16  17  18  19

In [58]:
choices = pd.Series([5, 7, -1, 6, 4])
draws = choices.sample(n=10, replace = True)#Sample with replacement
draws

3    6
2   -1
2   -1
4    4
4    4
1    7
4    4
2   -1
3    6
2   -1
dtype: int64

**Computing Idicator/Dummy Variables**

In [61]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
.....: 'data1': range(6)})
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [62]:
dummies = pd.get_dummies(df['key'], prefix = 'key')
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0